Repository: bhgv/Inferno-OS_Android-Clutter3d
Catalog: sources/clutter-android/po/*.po
Languages: ug

source: Max Length
ug: ئەڭ ئۇزۇن ئۇزۇنلۇقى

source: Single Line Mode
ug: يەككە قۇر ھالىتى

source: Whether the text should be a single line
ug: تېكىست بىرلا قۇر بولامدۇ يوق

source: Selected Text Color
ug: تاللانغان تېكىست رەڭگى

source: Selected Text Color Set
ug: تاللانغان تېكىست رەڭگىنىڭ تەڭشىكى

source: Whether the selected text color has been set
ug: تاللانغان تېكىستنىڭ رەڭگى تەڭشەلگەنمۇ يوق

source: Loop
ug: دەۋرىي

source: Should the timeline automatically restart
ug: ۋاقىت سىزىقى ئاپتوماتىك قايتا باشلىنىدۇ

source: Delay
ug: كېچىكتۈر

source: Delay before start
ug: باشلاشتىن ئاۋۋال كېچىكتۈرىدۇ

source: Duration
ug: ۋاقتى

source: Duration of the timeline in milliseconds
ug: ۋاقىت سىزىقىنىڭ مىللىسېكۇنت بىلەن ئىپادىلەنگەن ۋاقتى

source: Direction
ug: يۆنىلىش

source: Direction of the timeline
ug: ۋاقىت سىزىقىنىڭ يۆنىلىشى

source: Auto Reverse
ug: ئاپتوماتىك باشقا قايتسۇن

source: Whether the direction should be reversed when reaching the end
ug: ئەڭ ئاخىرغا بارغاندا ئاپتوماتىك ۋاقىت سىزىقىنىڭ بېشىغا قايتامدۇ يوق

source: Repeat Count
ug: تەكرارلاش قېتىمى

source: How many times the timeline should repeat
ug: قانچە قېتىم قايتىدۇ

source: Progress Mode
ug: ئىلگىرىلەش ھالىتى

source: How the timeline should compute the progress
ug: ۋاقىت سىزىقىنىڭ ئىلگىرىلەش ھالىتى

source: Interval
ug: ئىنتېرۋال

source: The interval of values to transition
ug: ئۆزگىرىش ۋاقتىنىڭ ئىنتېرۋالى

source: Animatable
ug: جانلاندۇرسۇن

source: The animatable object
ug: نەڭنى جانلاندۇرىدۇ

source: Remove on Complete
ug: تاماملانغاندا چىقىرىۋەتسۇن

source: Detach the transition when completed
ug: تاماملانغاندا ئۆزگىرىشنى ئايرىۋەتسۇن

source: Zoom Axis
ug: چوڭايتىش-كىچىكلىتىش ئوقى

source: Constraints the zoom to an axis
ug: چوڭايتىش-كىچىكلىتىش ئوقىنىڭ چەكلىمىسى

source: Timeline
ug: ۋاقىت سىزىقى

source: Timeline used by the alpha
ug: ئالفا ئىشلىتىدىغان ۋاقىت سىزىقى

source: Alpha value
ug: ئالفا قىممىتى

source: Alpha value as computed by the alpha
ug: ئالفا قىممىتى سۈپىتىدە ئىشلىتىدىغان ئالفا قىممىتى

source: Mode
ug: ھالىتى

source: Progress mode
ug: ئىلگىرىلەش ھالىتى

source: Object
ug: نەڭ

source: Object to which the animation applies
ug: جانلاندۇرۇم قوللىنىلىدىغان نەڭ

source: The mode of the animation
ug: جانلاندۇرۇمنىڭ ھالىتى

source: Duration of the animation, in milliseconds
ug: جانلاندۇرۇمنىڭ مىللىسېكۇنت بىلەن ئىپادىلەنگەن ۋاقتى

source: Whether the animation should loop
ug: جانلاندۇرۇم تەكرارلىنامدۇ

source: The timeline used by the animation
ug: جانلاندۇرۇم ئىشلىتىدىغان ۋاقىت سىزىقى

source: Alpha
ug: ئالفا

source: The alpha used by the animation
ug: جانلاندۇرۇم ئىشلىتىدىغان ئالفا

source: The duration of the animation
ug: جانلاندۇرۇمنىڭ ۋاقتى(ئۇزۇنلۇقى)

source: The timeline of the animation
ug: جانلاندۇرۇمنىڭ ۋاقىت سىزىقى

source: Alpha Object to drive the behaviour
ug: ھەرىكەتنى قوللايدىغان ئالفا نەڭنى

source: Start Depth
ug: باشلىنىش چوڭقۇرلۇقى

source: Initial depth to apply
ug: ئىشلىتىدىغان دەسلەپكى چوڭقۇرلۇقى

source: End Depth
ug: ئاخىرلىشىش چوڭقۇرلۇقى

source: Final depth to apply
ug: ئىشلىتىدىغان ئەڭ ئاخىرقى چوڭقۇرلۇقى

source: Start Angle
ug: باشلىنىش بۇلۇڭى

source: Initial angle
ug: دەسلەپكى بۇلۇڭى

source: End Angle
ug: ئاخىرلىشىش بۇلۇڭى

source: Final angle
ug: ئەڭ ئاخىرقى بۇلۇڭى

source: Angle x tilt
ug: X ئوقىنىڭ قىيسىق بۇلۇڭى

source: Tilt of the ellipse around x axis
ug: ئېللىپسنىڭ X ئوقى ئەتراپىدىكى قىيسىق بۇلۇڭى

source: Angle y tilt
ug: Y ئوقىنىڭ قىيسىق بۇلۇڭى

source: Tilt of the ellipse around y axis
ug: ئېللىپسنىڭ Y ئوقى ئەتراپىدىكى قىيسىق بۇلۇڭى

source: Angle z tilt
ug: Y ئوقىنىڭ قىيسىق بۇلۇڭى

source: Tilt of the ellipse around z axis
ug: ئېللىپسنىڭ Z ئوقى ئەتراپىدىكى قىيسىق بۇلۇڭى

source: Width of the ellipse
ug: ئېللىپسنىڭ كەڭلىكى

source: Height of ellipse
ug: ئېللىپسنىڭ ئېگىزلىكى

source: Center
ug: مەركەز

source: Center of ellipse
ug: ئېللىپسنىڭ مەركىزى

source: Direction of rotation
ug: چۆرۈلۈش يۆنىلىشى

source: Opacity Start
ug: باشلىنىش غۇۋالىقى

source: Initial opacity level
ug: دەسلەپكى غۇۋالىق دەرىجىسى

source: Opacity End
ug: ئاخىرلىشىش غۇۋالىقى

source: Final opacity level
ug: ئەڭ ئاخىرقى غۇۋالىق دەرىجىسى

source: Angle Begin
ug: باشلىنىش بۇلۇڭى

source: Angle End
ug: ئاخىرلىشىش بۇلۇڭى

source: Axis
ug: ئوق

source: Axis of rotation
ug: چۆرۈلۈش ئوقى

source: Center X
ug: مەركەز X

source: X coordinate of the center of rotation
ug: چۆرۈلۈشنىڭ X ئوقىدىكى مەركىزى

source: Center Y
ug: مەركەز Y

source: Y coordinate of the center of rotation
ug: چۆرۈلۈشنىڭ Y ئوقىدىكى مەركىزى

source: Center Z
ug: مەركەز Z

source: Z coordinate of the center of rotation
ug: چۆرۈلۈشنىڭ Z ئوقۇدىكى مەركىزى

source: X Start Scale
ug: چوڭايتىش-كىچىكلىتىشنىڭ X ئوقىدىكى دەسلەپكى قىممىتى

source: Initial scale on the X axis
ug: چوڭايتىش-كىچىكلىتىشنىڭ X ئوقىدىكى دەسلەپكى قىممىتى

source: X End Scale
ug: چوڭايتىش-كىچىكلىتىشنىڭ X ئوقىدىكى ئاخىرقى قىممىتى

source: Final scale on the X axis
ug: چوڭايتىش-كىچىكلىتىشنىڭ X ئوقىدىكى ئەڭ چوڭ قىممىتى

source: Y Start Scale
ug: چوڭايتىش-كىچىكلىتىشنىڭ Y ئوقىدىكى دەسلەپكى قىممىتى

source: Initial scale on the Y axis
ug: چوڭايتىش-كىچىكلىتىشنىڭ Y ئوقىدىكى دەسلەپكى قىممىتى

source: Y End Scale
ug: چوڭايتىش-كىچىكلىتىشنىڭ Y ئوقىدىكى ئاخىرقى قىممىتى

source: Final scale on the Y axis
ug: چوڭايتىش-كىچىكلىتىشنىڭ Y ئوقىدىكى ئەڭ چوڭ قىممىتى

source: The background color of the box
ug: كۆزنەكچە تەگلىكىنىڭ رەڭگى

source: Color Set
ug: رەڭ تەڭشىكى

source: Surface Width
ug: يۈزىنىڭ كەڭلىكى

source: The width of the Cairo surface
ug: Cairo يۈزىنىڭ كەڭلىكى

source: Surface Height
ug: يۈزىنىڭ ئېگىزلىكى

source: The height of the Cairo surface
ug: Cairo يۈزىنىڭ ئېگىزلىكى

source: Auto Resize
ug: چوڭلۇقى ئاپتوماتىك

source: Whether the surface should match the allocation
ug: يۈز تەقسىملەنگەن رايونغا ماسلىشامدۇ يوق

source: URI of a media file
ug: ۋاسىتە ھۆججەتنىڭ URI

source: Playing
ug: قويۇۋاتىدۇ

source: Progress
ug: سۈرئەت

source: Current progress of the playback
ug: ھازىرقى قويۇشنىڭ جەريانى

source: Subtitle URI
ug: فىلىم خېتىنىڭ URI ئى

source: URI of a subtitle file
ug: فىلىم خېتى ھۆججىتىنىڭ URI ئى

source: Subtitle Font Name
ug: فىلىم خېتىنىڭ خەت نۇسخىسى

source: The font used to display subtitles
ug: فىلىم خېتىنى كۆرسىتىشتە ئىشلىتىدىغان خەت نۇسخىسى

source: Audio Volume
ug: ئاۋاز چوڭلۇقى

source: The volume of the audio
ug: ئاۋازنىڭ چوڭلۇقى

source: Can Seek
ug: يۆتكىلەلەيدۇ

source: Whether the current stream is seekable
ug: نۆۋەتتىكى ئېقىم يۆتكىلەلەمدۇ

source: Buffer Fill
ug: يىغلەك تولۇشى

source: The fill level of the buffer
ug: يىغلەكنىڭ تولۇش دەرىجىسى

source: The duration of the stream, in seconds
ug: ئېقىمنىڭ سېكۇنت بىلەن ئىپادىلەنگەن ئۇزۇنلۇقى

source: The color of the rectangle
ug: تىك تۆت تەرەپلىكنىڭ رەڭگى

source: Border Color
ug: گىرۋەك رەڭگى

source: The color of the border of the rectangle
ug: تىك تۆت تەرەپلىكنىڭ گىرۋىكىنىڭ رەڭگى

source: Border Width
ug: گىرۋەك كەڭلىكى

source: The width of the border of the rectangle
ug: تىك تۆت تەرەپلىكنىڭ گىرۋىكىنىڭ كەڭلىكى

source: Has Border
ug: گىرۋەكلىك

source: Whether the rectangle should have a border
ug: تىك تۆت تەرەپلىكنىڭ گىرۋىكى بارمۇ يوق

source: Vertex Source
ug: Vertex نىڭ مەنبەسى

source: Fragment Source
ug: Fragment نىڭ مەنبەسى

source: Compiled
ug: يۇغۇرۇلغان

source: %s compilation failed: %s
ug: %s نى يۇغۇرۇش مەغلۇپ بولدى: %s

source: State
ug: ھالەت

source: Currently set state, (transition to this state might not be complete)
ug: نۆۋەتتە بەلگىلەنگەن ھالەت، (بۇ ھالەتكە ئۆتۈش تاماملانمىغان بولۇشى مۇمكىن)

source: Default transition duration
ug: كۆڭۈلدىكى ئۆتۈش ۋاقتى

source: Tile Waste
ug: ئارتۇقچە كاھىش

source: Horizontal repeat
ug: توغرا يۆنىلىشتە قايتىلاش

source: Repeat the contents rather than scaling them horizontally
ug: توغرا يۆنىلىشتە چوڭايتماي، مەزمۇننى تەكرارلايدۇ

source: Vertical repeat
ug: تىك يۆنىلىشتە قايتىلاش

source: Repeat the contents rather than scaling them vertically
ug: تىك يۆنىلىشتە چوڭايتماي، مەزمۇننى تەكرارلايدۇ

source: Filter Quality
ug: سۈزگۈچنىڭ سۈپىتى

source: Pixel Format
ug: پىكسېل پىچىمى

source: The Cogl pixel format to use
ug: ئىشلىتىدىغان پىكسېلنىڭ پىچىمى

source: Cogl Material
ug: Cogl ماتېرىيالى

source: The path of the file containing the image data
ug: سۈرەت سانلىق-مەلۇماتىنى ئوز ئىچىگە ئالغان ھۆججەتنىڭ يولى

source: Keep Aspect Ratio
ug: ئېگىزلىك-كەڭلىك نىسبىتى ئۆزگەرمىسۇن

source: Load asynchronously
ug: بىماس قەدەمدە ئوقۇسۇن

source: Load files inside a thread to avoid blocking when loading images from disk
ug: سۈرەت ھۆججەتلىرىنى دىسكىدىن ئوقۇۋاتقاندا توسۇلۇپ قېلىشتىن ساقلىنىش ئۈچۈن، ئىچكى thread دا ھۆججەتنى ئوقۇيدۇ

source: Load data asynchronously
ug: بىماس قەدەمدە سانلىق-مەلۇماتنى ئوقۇسۇن

source: Decode image data files inside a thread to reduce blocking when loading images from disk
ug: سۈرەت ھۆججەتلىرىنى دىسكىدىن ئوقۇۋاتقاندا توسۇلۇپ قېلىشنى ئازايتىش ئۈچۈن ئىچكى thread دا سۈرەتلەرنى كودسىزلايدۇ

source: Pick With Alpha
ug: ئالفا قىممىتىدە تاللىسۇن

source: Failed to load the image data
ug: سۈرەت ھۆججىتىنى ئوقۇش مەغلۇپ بولدى

source: sysfs Path
ug: sysfs نىڭ يولى

source: Path of the device in sysfs
ug: sysfs دىكى ئۈسكۈنىنىڭ يولى

source: Device Path
ug: ئۈسكۈنە يولى

source: Path of the device node
ug: ئۈسكۈنە تۈگۈنىنىڭ يولى

source: Surface
ug: سىرتقى يۈز

source: Surface width
ug: يۈزنىڭ كەڭلىكى

source: Surface height
ug: يۈزنىڭ ئېگىزلىكى

source: X display to use
ug: ئىشلىتىدىغان X كۆرسەتكۈچ

source: X screen to use
ug: ئىشلىتىدىغان X ئېكران

source: Make X calls synchronous
ug: X نى قەدەمداش قىلىپ ئىشلەت

source: Disable XInput support
ug: XInput قوللاشنى ئىناۋەتسىز قىل

source: The Clutter backend
ug: Clutter ئارقا ئۇچى

source: Pixmap width
ug: Pixmap كەڭلىكى

source: Pixmap height
ug: Pixmap ئېگىزلىكى

source: Pixmap Depth
ug: Pixmap چوڭقۇرلۇقى

source: Automatic Updates
ug: ئاپتوماتىك يېڭىلاش

source: Window
ug: كۆزنەك

source: Destroyed
ug: ۋەيران قىلىنغان

source: If window has been destroyed
ug: كۆزنەك ۋەيران قىلىنغانمۇ يوق

source: Window X
ug: كۆزنەك X

source: X position of window on screen according to X11
ug: ئېكراندىكى كۆزنەكنىڭ X11 دىكى X ئورنى

source: Window Y
ug: كۆزنەك Y

source: Y position of window on screen according to X11
ug: ئېكراندىكى كۆزنەكنىڭ X11 دىكى Y ئورنى
