Repository: bhgv/Inferno-OS_Android-Clutter3d
Catalog: sources/clutter-android/po/*.po
Languages: ug

source: X coordinate
ug: X كوئوردېنات

source: Y coordinate
ug: Y كوئوردېنات

source: Position
ug: ئورنى

source: Width
ug: كەڭلىك

source: Height
ug: ئېگىزلىك

source: Size
ug: چوڭلۇقى

source: Fixed X
ug: مۇقىم X

source: Fixed Y
ug: مۇقىم Y

source: Fixed position set
ug: مۇقىملاشتۇرۇلغان ئورۇن توپلىمى

source: Min Width
ug: ئەڭ كىچىك كەڭلىكى

source: Min Height
ug: ئەڭ كىچىك ئېگىزلىكى

source: Natural Width
ug: تەبىئىي كەڭلىكى

source: Natural Height
ug: تەبىئىي ئېگىزلىكى

source: Minimum width set
ug: ئەڭ كىچىك كەڭلىك توپلىمى

source: Whether to use the min-width property
ug: ئەڭ كىچىك كەڭلىك(min-width) خاسلىقىنى ئىشلىتەمدۇ يوق

source: Minimum height set
ug: ئەڭ كىچىك ئېگىزلىك توپلىمى

source: Whether to use the min-height property
ug: ئەڭ كىچىك ئېگىزلىك(min-height) خاسلىقىنى ئىشلىتەمدۇ يوق

source: Natural width set
ug: تەبىئىي كەڭلىك توپلىمى

source: Whether to use the natural-width property
ug: تەبىئىي كەڭلىك(natural-width) خاسلىقىنى ئىشلىتەمدۇ يوق

source: Natural height set
ug: تەبىئىي ئېگىزلىك توپلىمى

source: Whether to use the natural-height property
ug: تەبىئىي ئېگىزلىك(natural-height) خاسلىقىنى ئىشلىتەمدۇ يوق

source: Allocation
ug: تەقسىملەش

source: Request Mode
ug: ئىلتىماس ھالىتى

source: Depth
ug: چوڭقۇرلۇقى

source: Position on the Z axis
ug: Z ئوقىدىكى ئورنى

source: Z Position
ug: Z ئورنى

source: Opacity
ug: غۇۋالىقى

source: Visible
ug: كۆرۈنۈشچان

source: Mapped
ug: ئورۇنلاشتۇر

source: Realized
ug: جىسىملاشتۇرۇش

source: Has Clip
ug: ئىلغۇچى بار

source: Clip
ug: ئىلغۇچ

source: Clip Rectangle
ug: ئىلغۇچنىڭ دائىرىسى

source: Name
ug: ئاتى

source: Pivot Point
ug: چۆرگىلەش مەركىزى

source: The point around which the scaling and rotation occur
ug: چوڭايتىش-كىچىكلىتىش ۋە چۆرگىلىتىشنىڭ مەركىزى نۇقتىسى

source: Pivot Point Z
ug: Z ئوقىدىكى چۆرگىلەش مەركىزى

source: Z component of the pivot point
ug: چۆرگىلەش مەركىزىنىڭ Z ئوقىدىكى نۇقتىسى

source: Scale X
ug: X ئوقىدا چوڭايتىش-كىچىكلىتىش

source: Scale factor on the X axis
ug: X ئوقىدا چوڭايتىش-كىچىكلىتىش نىسبىتى

source: Scale Y
ug: Y ئوقىدا چوڭايتىش-كىچىكلىتىش

source: Scale factor on the Y axis
ug: Y ئوقىدا چوڭايتىش-كىچىكلىتىش نىسبىتى

source: Scale Z
ug: Z ئوقىدا چوڭايتىش-كىچىكلىتىش

source: Scale factor on the Z axis
ug: Z ئوقىدا چوڭايتىش-كىچىكلىتىش نىسبىتى

source: Scale Center X
ug: چوڭايتىش-كىچىكلىتىشنىڭ X ئوقىدىكى مەركىزى

source: Horizontal scale center
ug: توغرا يۆنىلىشتىكى چوڭايتىش-كىچىكلىتىشنىڭ مەركىزى

source: Scale Center Y
ug: چوڭايتىش-كىچىكلىتىشنىڭ Y ئوقىدىكى مەركىزى

source: Vertical scale center
ug: تىك يۆنىلىشتىكى چوڭايتىش-كىچىكلىتىشنىڭ مەركىزى

source: Scale Gravity
ug: چوڭايتىش-كىچىكلىتىشنىڭ ئېغىرلىق كۈچى يۆنىلىشىدىكى مەركىزى

source: The center of scaling
ug: چوڭايتىش-كىچىكلىتىشنىڭ مەركىزى

source: Rotation Angle X
ug: چۆرگىلىتىشنىڭ X ئوقىدىكى بۇلۇڭى

source: The rotation angle on the X axis
ug: چۆرگىلىتىشنىڭ X ئوقىدىكى بۇلۇڭى

source: Rotation Angle Y
ug: چۆرگىلىتىشنىڭ Y ئوقىدىكى بۇلۇڭى

source: The rotation angle on the Y axis
ug: چۆرگىلىتىشنىڭ Y ئوقىدىكى بۇلۇڭى

source: Rotation Angle Z
ug: چۆرگىلىتىشنىڭ Z ئوقىدىكى بۇلۇڭى

source: The rotation angle on the Z axis
ug: چۆرگىلىتىشنىڭ Z ئوقىدىكى بۇلۇڭى

source: Rotation Center X
ug: چۆرگىلىتىشنىڭ X ئوقىدىكى مەركىزى

source: The rotation center on the X axis
ug: چۆرگىلىتىشنىڭ X ئوقىدىكى مەركىزى

source: Rotation Center Y
ug: چۆرگىلىتىشنىڭ Y ئوقىدىكى مەركىزى

source: The rotation center on the Y axis
ug: چۆرگىلىتىشنىڭ Y ئوقىدىكى مەركىزى

source: Rotation Center Z
ug: چۆرگىلىتىشنىڭ Z ئوقىدىكى مەركىزى

source: The rotation center on the Z axis
ug: چۆرگىلىتىشنىڭ Z ئوقىدىكى مەركىزى

source: Rotation Center Z Gravity
ug: چۆرگىلىتىشنىڭ Z ئوقىدىكى مەركىزى

source: Center point for rotation around the Z axis
ug: چۆرگىلىتىشنىڭ Z ئوقىدىكى مەركىزى نۇقتىسى

source: Anchor X
ug: لەڭگەر X

source: X coordinate of the anchor point
ug: لەڭگەر نۇقتىسىنىڭ X كوئوردېناتى

source: Anchor Y
ug: لەڭگەر Y

source: Y coordinate of the anchor point
ug: لەڭگەر نۇقتىسىنىڭ Y كوئوردېناتى

source: Anchor Gravity
ug: لەڭگەرنىڭ ئېغىرلىقى

source: The anchor point as a ClutterGravity
ug: ClutterGravity سۈپىتىدىكى لەڭگەر نۇقتىسى

source: Translation X
ug: X ئوقىدىكى يۆتكىلىش

source: Translation along the X axis
ug: X ئوقى يۆنىلىشىدىكى يۆتكىلىش

source: Translation Y
ug: Y ئوقىدىكى يۆتكىلىش

source: Translation along the Y axis
ug: Y ئوقى يۆنىلىشىدىكى يۆتكىلىش

source: Translation Z
ug: Z ئوقىدىكى يۆتكىلىش

source: Translation along the Z axis
ug: Z ئوقى يۆنىلىشىدىكى يۆتكىلىش

source: Transform
ug: ئۆزگەرتىش

source: Transformation matrix
ug: ئۆزگەرتىش ماترىتساسى

source: Transform Set
ug: ئۆزگەرتىش توپلىمى

source: Whether the transform property is set
ug: ئۆزگەرتىش خاسلىقىنى بەلگىلەمدۇ يوق

source: Child Transform
ug: بالا نەڭنى ئۆزگەرتىش

source: Children transformation matrix
ug: بالا نەڭنى ئۆزگەرتىدىغان ماترىتسا

source: Child Transform Set
ug: بالا ئۆزگەرتىش تەڭشىكى

source: Whether the child-transform property is set
ug: بالا ئۆزگەرتىش(child-transform) خاسلىقىنى ئىشلىتەمدۇ يوق

source: Show on set parent
ug: ئاتا قىلىپ بەلگىلەنگەندە كۆرسەتسۇن

source: Text Direction
ug: تېكىست يۆنىلىشى

source: Direction of the text
ug: تېكىست يۆنىلىشى

source: Has Pointer
ug: ئىسترېلكا بار

source: Actions
ug: مەشغۇلاتلار

source: Constraints
ug: چەكلىمىلەر

source: Effect
ug: ئۈنۈم

source: Layout Manager
ug: ئورۇنلاشتۇرما باشقۇرغۇچ

source: X Expand
ug: X كېڭىيىش

source: Y Expand
ug: Y كېڭىيىش

source: X Alignment
ug: X توغرىلاش

source: Y Alignment
ug: Y توغرىلاش

source: Margin Top
ug: ئۈستىدىكى بوشلۇق

source: Extra space at the top
ug: ئۈستىدىكى ئارتۇقچە بوشلۇق

source: Margin Bottom
ug: ئاستىدىكى بوشلۇق

source: Extra space at the bottom
ug: ئاستىدىكى ئارتۇقچە بوشلۇق

source: Margin Left
ug: سولدىكى بوشلۇق

source: Extra space at the left
ug: سولدىكى ئارتۇقچە بوشلۇق

source: Margin Right
ug: ئوڭدىكى بوشلۇق

source: Extra space at the right
ug: ئوڭدىكى ئارتۇقچە بوشلۇق

source: Background Color Set
ug: تەگلىك رەڭگى تەڭشىكى

source: Whether the background color is set
ug: تەگلىك رەڭگى تەڭشىكىنى ئىشلىتەمدۇق يوق

source: Background color
ug: تەگلىك رەڭگى

source: First Child
ug: تۇنجى بالا

source: Last Child
ug: كەنجى بالا

source: Content
ug: مەزمۇن

source: Content Gravity
ug: مەزمۇننىڭ ئېغىرلىقى

source: Content Box
ug: مەزمۇن قۇتىسى

source: Minification Filter
ug: كىچىكلىتىش سۈزگۈچى

source: The filter used when reducing the size of the content
ug: مەزمۇننىڭ چوڭلۇقىنى كىچىكلىتىدىغان ۋاقىتتا ئىشلىتىدىغان سۈزگۈچ

source: Magnification Filter
ug: چوڭايتىش سۈزگۈچى

source: The filter used when increasing the size of the content
ug: مەزمۇننىڭ چوڭلۇقىنى چوڭايتىدىغان ۋاقىتتا ئىشلىتىدىغان سۈزگۈچ

source: Content Repeat
ug: مەزمۇننىڭ تەكرارلىنىشى

source: The name of the meta
ug: مېتا ئۇچۇرلارنىڭ ئاتى

source: Enabled
ug: ئىناۋەتلىك قىلىنغان

source: Whether the meta is enabled
ug: مېتا ئۇچۇرلارنىڭ ئىناۋەتلىك قىلىنغانمۇ يوق

source: Source
ug: مەنبە

source: The source of the alignment
ug: توغرىلاشنىڭ مەنبەسى

source: Align Axis
ug: توغرىلاش ئوقى

source: The axis to align the position to
ug: ئورۇننى توغرىلايدىغان ئوق

source: Factor
ug: كۆپەيتكۈچى

source: The alignment factor, between 0.0 and 1.0
ug: توغرىلاش فاكتورى، قىممىتى 0.0 دىن 1.0 ئارىلىقىدا

source: Unable to initialize the Clutter backend
ug: Clutter ئارقا ئۇچىنى دەسلەپلەشتۈرگىلى بولمىدى

source: The backend of type '%s' does not support creating multiple stages
ug: تىپ ‹%s› نىڭ ئارقا ئۇچى بىر قانچە سەھنە قۇرۇشنى قوللىمايدۇ

source: The source of the binding
ug: باغنىڭ مەنبەسى

source: Coordinate
ug: كوئوردېناتى

source: The coordinate to bind
ug: باغلايدىغان كوئوردېنات

source: Offset
ug: ئېغىش

source: The offset in pixels to apply to the binding
ug: پىكسېل بىلەن ئىپادىلەنگەن باغقا ئىشلىتىدىغان ئېغىش

source: The unique name of the binding pool
ug: باغ كۆلچىكىنىڭ ئالاھىدە ئاتى

source: Horizontal Alignment
ug: توغرىسىغا توغرىلاش

source: Vertical Alignment
ug: بويىغا توغرىلاش

source: Expand
ug: كېڭەيت

source: Allocate extra space for the child
ug: بالا ئۈچۈن قوشۇمچە بوشلۇق تەقسىملەيدۇ

source: Horizontal Fill
ug: توغرىسىغا تولدۇرۇش

source: Vertical Fill
ug: بويىغا تولدۇرۇش

source: Vertical
ug: تىك

source: Whether the layout should be vertical, rather than horizontal
ug: جايلاشتۇرۇشنىڭ يۆنىلىشى توغرىسىغا ئەمەس بويىغا بولىدۇ

source: Orientation
ug: يۆنىلىش

source: The orientation of the layout
ug: جايلاشتۇرۇشنىڭ يۆنىلىشى

source: Homogeneous
ug: ئوخشاش

source: Whether the layout should be homogeneous, i.e. all childs get the same size
ug: بارلىق بالا نەڭلەرنىڭ چوڭلۇقى ئوخشاش بولامدۇ يوق

source: Spacing
ug: ئارىلىق

source: Spacing between children
ug: بالىلار ئارىسىدىكى بوشلۇق

source: Use Animations
ug: جانلاندۇرۇم

source: Whether layout changes should be animated
ug: ئورۇنلاشتۇرۇشنىڭ ئۆزگىرىشى ھەرىكەتلىك بولسۇنمۇ

source: Brightness
ug: يورۇقلۇق

source: The brightness change to apply
ug: يورۇقلۇقنىڭ ئۆزگىرىشىنى قوللىنىدۇ

source: Contrast
ug: ئاق-قارىلىقى

source: The contrast change to apply
ug: ئاق-قارىلىقنىڭ ئۆزگىرىشىنى قوللىنىدۇ

source: The width of the canvas
ug: كەرگىنىڭ كەڭلىكى

source: The height of the canvas
ug: كەرگىنىڭ ئېگىزلىكى

source: Container
ug: قاچا

source: The container that created this data
ug: مەزكۇر سانلىق-مەلۇماتنى ياسىغان قاچا

source: Pressed
ug: بېسىلغان

source: Whether the clickable should be in pressed state
ug: بېسىلىدىغان نەرسە بېسىقلىق پېتى تۇرامدۇ يوق

source: Held
ug: تۇتۇپ تۇرۇلغان

source: Whether the clickable has a grab
ug: بېسىلىدىغان نەرسىنىڭ ھالىتى ساقلىنىپ قالامدۇ يوق

source: Long Press Duration
ug: ئۇزۇن بېسىشنىڭ ۋاقتى

source: The minimum duration of a long press to recognize the gesture
ug: ئىشارەتنى تونۇش ئۈچۈن كېرەك بولىدىغان ئۇزۇن بېسىشنىڭ ئەڭ كىچىك ۋاقتى

source: Long Press Threshold
ug: ئۇزۇن بېسىشنىڭ بوسۇغا قىممىتى

source: The maximum threshold before a long press is cancelled
ug: ئۇزۇن بېسىشنى ئەمەلدىن قالدۇرۇشتا كېرەك بولىدىغان ئەڭ چوڭ بوسۇغا قىممىتى

source: Tint
ug: رەڭلە

source: The tint to apply
ug: قوللىنىدىغان رەڭلەش

source: Horizontal Tiles
ug: توغرا يۆنىلىشتىكى كاھىش

source: The number of horizontal tiles
ug: توغرا يۆنىلىشتىكى كاھىشنىڭ سانى

source: Vertical Tiles
ug: تىك يۆنىلىشتىكى كاھىش

source: The number of vertical tiles
ug: تىك يۆنىلىشتىكى كاھىشنىڭ سانى

source: Back Material
ug: ئارقا ماتېرىيالى

source: The desaturation factor
ug: تويۇنۇشتىن چىقىش كۆپەيتكۈچىسى

source: Backend
ug: ئارقا ئۇچ

source: The ClutterBackend of the device manager
ug: ئۈسكۈنە باشقۇرغۇنىڭ ClutterBackend

source: Horizontal Drag Threshold
ug: توغرا يۆنىلىشتىكى سۆرەش بوسۇغا قىممىتى

source: The horizontal amount of pixels required to start dragging
ug: سۆرەشنى باشلاشقا كېرەك بولىدىغان توغرا يۆنىلىشتىكى پىكسېلنىڭ مىقدارى

source: Vertical Drag Threshold
ug: تىك يۆنىلىشتىكى سۆرەش بوسۇغا قىممىتى

source: The vertical amount of pixels required to start dragging
ug: سۆرەشنى باشلاشقا كېرەك بولىدىغان تىك يۆنىلىشتىكى پىكسېلنىڭ مىقدارى

source: Drag Handle
ug: سۆرەش تۇتقۇسى

source: Drag Axis
ug: سۆرەش ئوقى

source: Constraints the dragging to an axis
ug: ئوققا سۆرەشتىكى چەكلىمە

source: Drag Area
ug: سۆرەش دائىرىسى

source: Constrains the dragging to a rectangle
ug: تىك تۆت تەرەپلىككە سۆرەيدىغان چەكلىمە

source: Drag Area Set
ug: سۆرەش دائىرىسى تەڭشىكى

source: Whether the drag area is set
ug: سۆرەش دائىرىسى تەڭشىكى ئىشلىتىلەمدۇ يوق

source: Whether each item should receive the same allocation
ug: ھەر بىر تۈر ئوخشاش تەقسىملەشنى قوبۇل قىلامدۇ يوق

source: Column Spacing
ug: ئىستون بوشلۇقى

source: The spacing between columns
ug: ئىستونلار ئارىسىدىكى بوشلۇق

source: Row Spacing
ug: قۇر بوشلۇقى

source: The spacing between rows
ug: قۇرلار ئارىسىدىكى بوشلۇق

source: Minimum Column Width
ug: ئىستوننىڭ ئەڭ كىچىك كەڭلىكى

source: Minimum width for each column
ug: ھەر بىر ئىستوننىڭ ئەڭ كىچىك كەڭلىكى

source: Maximum Column Width
ug: ئىستوننىڭ ئەڭ چوڭ كەڭلىكى

source: Maximum width for each column
ug: ھەر بىر ئىستوننىڭ ئەڭ چوڭ كەڭلىكى

source: Minimum Row Height
ug: قۇرنىڭ ئەڭ كىچىك ئېگىزلىكى

source: Minimum height for each row
ug: ھەر بىر قۇرنىڭ ئەڭ كىچىك ئېگىزلىكى

source: Maximum Row Height
ug: قۇرنىڭ ئەڭ چوڭ ئېگىزلىكى

source: Maximum height for each row
ug: بەر بىر قۇرنىڭ ئەڭ چوڭ ئېگىزلىكى

source: Left attachment
ug: سول قوشۇلما

source: The column number to attach the left side of the child to
ug: تارماق بۆلەكنىڭ سول تەرىپىنى قايسى ئىستونغا قوشىدۇ

source: Top attachment
ug: ئۈستى قوشۇلما

source: The row number to attach the top side of a child widget to
ug: تارماق ۋىجېتنىڭ ئۈستى تەرىپىنى قايسى قۇرغا قوشىدۇ

source: The number of columns that a child spans
ug: بىرىكىدىغان بالا ئىستونلارنىڭ سانى

source: The number of rows that a child spans
ug: بىرىكىدىغان بالا قۇرلارنىڭ سانى

source: Row spacing
ug: قۇر بوشلۇقى

source: The amount of space between two consecutive rows
ug: ئىككى قۇر ئارىسىدىكى بوشلۇق

source: Column spacing
ug: ئىستون بوشلۇقى

source: The amount of space between two consecutive columns
ug: ئىككى ئىستون ئارىسىدىكى بوشلۇق

source: Row Homogeneous
ug: قۇر ئوخشاش

source: If TRUE, the rows are all the same height
ug: ئەگەر TRUE بولسا، قۇرنىڭ ھەممىسى ئوخشاش ئېگىزلىكتە بولىدۇ.

source: Column Homogeneous
ug: ئىستون ئوخشاش

source: If TRUE, the columns are all the same width
ug: ئەگەر TRUE بولسا، ئىستوننىڭ ھەممىسى ئوخشاش كەڭلىكتە بولىدۇ.

source: Unable to load image data
ug: سۈرەت ھۆججىتىنى ئوقۇغىلى بولمىدى

source: Id
ug: كىملىك

source: Unique identifier of the device
ug: ئۈسكۈنىنىڭ ئۆزگىچە كىملىكى

source: The name of the device
ug: ئۈسكۈنىنىڭ ئاتى

source: Device Type
ug: ئۈسكۈنە تىپى

source: The type of the device
ug: ئۈسكۈنىنىڭ تىپى

source: Device Manager
ug: ئۈسكۈنە باشقۇرغۇ

source: The device manager instance
ug: ئۈسكۈنە باشقۇرغۇ ئۈلگىسى

source: Device Mode
ug: ئۈسكۈنە ھالىتى

source: The mode of the device
ug: ئۈسكۈنىنىڭ ھالىتى

source: Has Cursor
ug: نۇربەلگىسى بار

source: Whether the device has a cursor
ug: ئۈسكۈنىنىڭ نۇربەلگىسى بارمۇ يوق

source: Whether the device is enabled
ug: ئۈسكۈنە ئىناۋەتلىك قىلىنغانمۇ يوق

source: Number of Axes
ug: ئوق سانى

source: The number of axes on the device
ug: ئۈسكۈنىدىكى ئوق سانى

source: The backend instance
ug: ئارقا ئۇچ ئۈلگىسى

source: Value Type
ug: قىممەت تىپى

source: The type of the values in the interval
ug: ئىنتېرۋال قىممىتىنىڭ تىپى

source: Initial Value
ug: دەسلەپكى قىممەت

source: Initial value of the interval
ug: ئىنتېرۋالنىڭ دەسلەپكى قىممىتى

source: Final Value
ug: ئاخىرقى قىممەت

source: Final value of the interval
ug: ئىنتېرۋالنىڭ ئاخىرقى قىممىتى

source: Manager
ug: باشقۇرغۇ

source: The manager that created this data
ug: مۇشۇ سانلىق-مەلۇماتنىڭ قۇرغان باشقۇرغۇ

source: default:LTR
ug: default:RTL

source: Show frames per second
ug: بىر سېكۇنتتا كۆرسىتىدىغان كاندۇك سانى

source: Default frame rate
ug: كۆڭۈلدىكى كاندۇك تېزلىكى

source: Make all warnings fatal
ug: ھەممە ئاگاھلاندۇرۇشنى ئېغىر خاتالىققا ئۆزگەرت

source: Direction for the text
ug: يېزىق يۆنىلىشى

source: Disable mipmapping on text
ug: تېكىستنىڭ mipmapping نى ئىناۋەتسىز قىلسۇن

source: Use 'fuzzy' picking
ug: 'fuzzy' تاللاشنى ئىشلەتسۇن

source: Clutter debugging flags to set
ug: بەلگىلىنىدىغان سازلاش بەلگىلىرى(Clutter نىڭ)

source: Clutter debugging flags to unset
ug: بەلگىلەنمەيدىغان سازلاش بەلگىلىرى(Clutter نىڭ)

source: Clutter profiling flags to set
ug: بەلگىلىنىدىغان سەپلەك(profiling) بەلگىلىرى(Clutter نىڭ)

source: Clutter profiling flags to unset
ug: بەلگىلەنمەيدىغان سەپلەك(profiling) بەلگىلىرى(Clutter نىڭ)

source: Enable accessibility
ug: قوشۇمچە ئىقتىدارنى ئىناۋەتلىك قىل

source: Clutter Options
ug: Clutter تاللانمىسى

source: Show Clutter Options
ug: Clutter تاللانمىسىنى كۆرسىتىش

source: Pan Axis
ug: Pan ئوقى

source: Interpolate
ug: تولۇقلاش

source: Whether interpolated events emission is enabled.
ug: تولۇقلاش ھادىسىنىڭ پەيدا بولۇشىنى ئىشلىتەمدۇ يوق.

source: Deceleration
ug: ئاستىلاش

source: Initial acceleration factor
ug: دەسلەپكى تېزلىتىش مىقدارى(factor)

source: Factor applied to the momentum when starting the interpolated phase
ug: تولۇقلاش باسقۇچى باشلانغاندىكى ھەرىكەت مىقدارىنىڭ كۆپەيتكۈچىسى

source: Path
ug: يول

source: The offset along the path, between -1.0 and 2.0
ug: يوللار ئارىسىدىكى ئېغىش(offset)، -1.0 بىلەن 2.0 نىڭ ئارىسىدا

source: Property Name
ug: خاسلىق ئاتى

source: The name of the property to animate
ug: جانلاندۇرىدىغان خاسلىقنىڭ ئاتى

source: Filename Set
ug: ھۆججەت ئاتى تەڭشىكى

source: Whether the :filename property is set
ug: ھۆججەت ئاتى (:filename) تەڭشىكى بەلگىلىنەمدۇ يوق

source: Filename
ug: ھۆججەت ئاتى

source: The path of the currently parsed file
ug: نۆۋەتتە تەھلىل قىلىنغان ھۆججەتنىڭ يولى

source: Translation Domain
ug: تەرجىمە دائىرىسى

source: The translation domain used to localize string
ug: تېكىستنى يەرلىكلەشتۈرۈشتە ئىشلىتىدىغان تەرجىمە دائىرىسى

source: Scroll Mode
ug: سىيرىش ھالىتى

source: The scrolling direction
ug: سىيرىش يۆنىلىشى

source: Double Click Time
ug: قوش چېكىشنىڭ ۋاقتى

source: The time between clicks necessary to detect a multiple click
ug: بىر قانچە قېتىملىق چېكىلىشنى بايقاشقا كېرەك بولىدىغان چېكىلىشنىڭ ۋاقتى

source: Double Click Distance
ug: قوش چېكىش ئارىلىقى

source: The distance between clicks necessary to detect a multiple click
ug: بىر قانچە قېتىملىق چېكىلىشنى بايقاشقا كېرەك چېكىلىشنىڭ يۆتكىلىش ئارىلىقى

source: Drag Threshold
ug: سۆرەشنىڭ بوسۇغا قىممىتى

source: The distance the cursor should travel before starting to drag
ug: سۆرەش باشلانغاندىن باشلاپ نۇربەلگىسى يۆتكەلگەن ئارىلىق

source: Font Name
ug: خەت نۇسخا ئاتى

source: The description of the default font, as one that could be parsed by Pango
ug: پانگو(Pango) چۈشىنىدىغان، كۆڭۈلدىكى خەت نۇسخىسىنىڭ چۈشەندۈرۈلۈشى

source: Font Antialias
ug: خەت نۇسخىسىنى سىلىقلاش

source: Whether to use antialiasing (1 to enable, 0 to disable, and -1 to use the default)
ug: سىلىقلاشنى ئىشلىتەمدۇ يوق(1 ئىشلىتىدۇ، 0 ئىشلەتمەيدۇ، -1 كۆڭۈلدىكىنى ئىشلىتىدۇ)

source: Font DPI
ug: خەت نۇسخىسىنىڭ DPI

source: The resolution of the font, in 1024 * dots/inch, or -1 to use the default
ug: خەت نۇسخىسىنىڭ ئېنىقلىقى. ئادەتتە 1024 * dots/inch نى ئىشلىتىدۇ، -1 بولسا كۆڭۈلدىكىنى ئىشلىتىدۇ

source: The minimum duration for a long press gesture to be recognized
ug: ئۇزۇن بېسىلغان ئىشارەت دەپ ھۆكۈم قىلىش ئۈچۈن كېرەك بولىدىغان ئەڭ كىچىك ۋاقىت

source: Fontconfig configuration timestamp
ug: Fontconfig سەپلىمە ۋاقتى

source: Timestamp of the current fontconfig configuration
ug: نۆۋەتتىكى fontconfig سەپلىمىسىنىڭ ۋاقىت-چېسلاسى

source: Password Hint Time
ug: ئىم ھەققىدىكى كۆرسەتمىنى كۆرسىتىش ۋاقتى

source: How long to show the last input character in hidden entries
ug: يوشۇرۇن كىرگۈزۈش رامكىسىدا ئاخىرقى قېتىم كىرگۈزگەن ھەرپنى قانچىلىك ۋاقىت كۆرسىتىدۇ

source: The source of the constraint
ug: چەكلىمىنىڭ مەنبەسى

source: From Edge
ug: گىرۋەكتىن

source: To Edge
ug: گىرۋەككىچە

source: Fullscreen Set
ug: تولۇق ئېكران تەڭشىكى

source: Whether the main stage is fullscreen
ug: ئاساسىي سەھنە تولۇق ئېكرانمۇ ئەمەسمۇ

source: Offscreen
ug: ئېكرانسىز

source: Whether the main stage should be rendered offscreen
ug: ئاساسىي سەھنە ئېكرانسىز ھالەتتە سىزىلامدۇ يوق

source: Cursor Visible
ug: نۇربەلگىسىنى كۆرسىتىش

source: Whether the mouse pointer is visible on the main stage
ug: ئاساسىي سەھنىدە چاشقىنەك نۇربەلگىسى كۆرۈنەمدۇ يوق

source: User Resizable
ug: ئىشلەتكۈچى ئۆزگەرتەلىسۇن

source: Whether the stage is able to be resized via user interaction
ug: ئاساسىي سەھنىنىڭ چوڭلۇقىنى ئىشلەتكۈچى ئۆزگەرتەلەمدۇ يوق

source: Color
ug: رەڭ

source: The color of the stage
ug: سەھنىنىڭ رەڭگى

source: Title
ug: ماۋزۇ

source: Stage Title
ug: سەھنە ماۋزۇسى

source: Use Fog
ug: تۇمان ئىشلەتسۇن

source: Fog
ug: تۇمان

source: Use Alpha
ug: ئالفا ئىشلەتسۇن

source: Whether to honour the alpha component of the stage color
ug: سەھنە رەڭگىنىڭ ئالفا قىممىتىنى ھۆرمەتلەمدۇ يوق

source: Key Focus
ug: كۇنۇپكا فوكۇسى

source: Whether the stage should clear its contents
ug: سەھنە ئۆزىنىڭ مەزمۇنلىرىنى تازىلامدۇ يوق

source: Accept Focus
ug: فوكۇسنى قوبۇل قىلسۇن

source: Whether the stage should accept focus on show
ug: كۆرسىتىلگەندە سەھنە فوكۇسنى قوبۇل قىلامدۇ يوق

source: Column Number
ug: ئىستون نومۇرى

source: The column the widget resides in
ug: ۋىجېت تۇرىدىغان ئىستون

source: Row Number
ug: قۇر نومۇرى

source: The row the widget resides in
ug: ۋىجېت تۇرىدىغان قۇر

source: Column Span
ug: ئىستون بىرىكتۈرۈش

source: The number of columns the widget should span
ug: بىرىكتۈرۈلىدىغان ئىستوننىڭ سانى

source: Row Span
ug: قۇر بىرىكتۈرۈش

source: The number of rows the widget should span
ug: بىرىكتۈرۈلىدىغان قۇرنىڭ سانى

source: Horizontal Expand
ug: توغرا يۆنىلىشتە كېڭىيىش

source: Allocate extra space for the child in horizontal axis
ug: بالا نەڭ ئۈچۈن توغرا يۆنىلىشتە ئارتۇقچە بوشلۇق تەقسىملەيدۇ

source: Vertical Expand
ug: تىك يۆنىلىشتە كېڭىيىش

source: Allocate extra space for the child in vertical axis
ug: بالا نەڭ ئۈچۈن تىك يۆنىلىشتە ئارتۇقچە بوشلۇق تەقسىملەيدۇ

source: Spacing between columns
ug: ئىستونلار ئارىسىدىكى بوشلۇق

source: Spacing between rows
ug: قۇرلار ئارىسىدىكى بوشلۇق

source: Text
ug: تېكىست

source: The contents of the buffer
ug: يىغلەك مەزمۇنى

source: Text length
ug: تېكىست ئۇزۇنلۇقى

source: Length of the text currently in the buffer
ug: نۆۋەتتىكى يىغلەكتىكى تېكىستنىڭ ئۇزۇنلۇقى

source: Maximum length
ug: ئەڭ چوڭ ئۇزۇنلۇق

source: Maximum number of characters for this entry. Zero if no maximum
ug: بۇ تۈرگە كىرگۈزگىلى بولىدىغان ئەڭ كۆپ ھەرپ سانى. نۆل چەكلىمەسلىكنى بىلدۈرىدۇ

source: Buffer
ug: يىغلەك

source: The buffer for the text
ug: تېكىست ئۈچۈن ئىشلىتىلىدىغان يىغلەك

source: The font to be used by the text
ug: تېكىست ئۈچۈن ئىشلىتىلىدىغان خەت نۇسخىسى

source: Font Description
ug: خەت نۇسخىسى چۈشەندۈرۈلۈشى

source: The font description to be used
ug: ئىشلىتىلىدىغان خەت نۇسخىسى چۈشەندۈرۈلۈشى

source: The text to render
ug: سىزىلىدىغان تېكىست

source: Font Color
ug: خەت رەڭگى

source: Color of the font used by the text
ug: تېكىستنىڭ رەڭگى

source: Editable
ug: تەھرىرچان

source: Whether the text is editable
ug: تېكىستنى تەھرىرلىگىلى بولامدۇ يوق

source: Selectable
ug: تاللاشچان

source: Whether the text is selectable
ug: تېكىستنى تاللىغىلى بولامدۇ يوق

source: Activatable
ug: ئاكتىپلاشچان

source: Whether pressing return causes the activate signal to be emitted
ug: قايتۇرۇش كۇنۇپكىسى بېسىلغان ئاكتىپلاش(activate) سىگنالىنى ئەۋەتەمدۇ يوق

source: Whether the input cursor is visible
ug: كىرگۈزۈش نۇربەلگىسى كۆرۈنەمدۇ يوق

source: Cursor Color
ug: نۇربەلگە رېڭى

source: Cursor Color Set
ug: نۇربەلگە رەڭ تەڭشىكى

source: Whether the cursor color has been set
ug: نۇربەلگە رەڭگى بەلگىلەنگەنمۇ يوق

source: Cursor Size
ug: نۇربەلگە چوڭلۇقى

source: The width of the cursor, in pixels
ug: نۇربەلگىنىڭ پىكسېل ئارقىلىق ئىپادىلەنگەن كەڭلىكى

source: Cursor Position
ug: نۇربەلگە ئورنى

source: The cursor position
ug: نۇربەلگىنىڭ ئورنى

source: Selection-bound
ug: تاللانما دائىرىسى

source: The cursor position of the other end of the selection
ug: تاللانمىنىڭ يەنە بىر تەرىپىدىكى نۇر بەلگىسىنىڭ ئورنى

source: Selection Color
ug: تاللانما رەڭگى

source: Selection Color Set
ug: تاللانمىنىڭ رەڭگى تەڭشىكى

source: Whether the selection color has been set
ug: تاللانمىنىڭ رەڭگى بەلگىلەنگەنمۇ يوق

source: Attributes
ug: خاسلىقلار

source: Use markup
ug: بەلگە ئىشلەت

source: Line wrap
ug: قۇر قاتلا

source: If set, wrap the lines if the text becomes too wide
ug: ئەگەر تاللانسا، قۇرلار بەك ئۇزۇن بولۇپ كەتسە ئۇنى قاتلايدۇ

source: Line wrap mode
ug: قۇر قاتلاش ھالىتى

source: Control how line-wrapping is done
ug: قۇرنى قانداق قاتلاشنى تىزگىنلەيدۇ

source: Ellipsize
ug: قىسقارتىلغان بەلگە

source: The preferred place to ellipsize the string
ug: قىسقارتىلغان بەلگىنى قويىدىغان ئەڭ ياخشى ئورۇن

source: Line Alignment
ug: قۇر توغرىلىنىشى

source: The preferred alignment for the string, for multi-line text
ug: كوپ قۇرلۇق تېكىستلەردىكى قۇرنىڭ توغرىلىنىشى

source: Justify
ug: ئوڭ-سول تەرىپى تەكشى

source: Whether the text should be justified
ug: تېكىستنىڭ ئوڭ-سول تەرىپى تەكشىمۇ ئەمەسمۇ

source: Password Character
ug: ئىم ھەرپى
